src/InformationRegisters/МФМакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>МФМакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСовпадает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МФМакеты/Forms/ФормаСписка/Ext/Form/Module.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьМакет(Команда)
	МакетыКОбновлению = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		Если Не ДанныеСтроки.МакетСовпадает Тогда
			МакетыКОбновлению.Добавить(Новый Структура(
				"ИмяФормы, ИмяМакета",
				ДанныеСтроки.ИмяФормы,
				ДанныеСтроки.ИмяМакета
			));
		КонецЕсли;
	КонецЦикла;
	
	Если МакетыКОбновлению.Количество() = 0 Тогда
		ПоказатьПредупреждение(
			,
			НСтр("ru='Отсутствуют отличающиеся макеты'"),
			,
			НСтр("ru='Ошибка'")
		);
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МакетыКОбновлению", МакетыКОбновлению);
	Оповещение = Новый ОписаниеОповещения(
		"ПослеПоказаВопросаОбОбновленииМакета",
		ЭтаФорма,
		ДополнительныеПараметры
	);
	ПоказатьВопрос(
		Оповещение,
		НСтр("ru='Выбранные макеты будут обновлены данными из конфигурации. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет,
		30,
		КодВозвратаДиалога.Нет,
		НСтр("ru='Обновление макетов'"),
		КодВозвратаДиалога.Нет
	);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтсутствующиеОбъекты(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПоказаВопросаОбОбновленииМакета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьМакеты(ДополнительныеПараметры.МакетыКОбновлению);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьМакеты(МакетыКОбновлению)
	РегистрыСведений.МФМакеты.ОбновитьМакетыОписанияМодификацийИзКонфигурации(МакетыКОбновлению);
КонецПроцедуры

#КонецОбласти
